app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" WHERE (title LIKE '%#{search}%') LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "properties" WHERE (title LIKE '%build%')
---
  def index
    @properties = Property.search(params[:search]).paginate(:per_page => 6, :page => params[:page])

INSERT INTO "properties" ("amount", "city", "created_at", "description", "image", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save

UPDATE "properties" SET "description" = $1, "updated_at" = $2 WHERE "properties"."id" = 5  [["description", "A giant building for sale!"], ["updated_at", Tue, 30 Jul 2013 16:25:20 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @property.update(property_params)